Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/goormdotcom/prod/runs/run-wRzwLEogXBSXF9PR

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.ecr_order.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/order-service]
module.common_network.aws_vpc.goorm: Refreshing state... [id=vpc-05849d37708e8d04b]
module.rds_order.aws_db_parameter_group.this: Refreshing state... [id=order-pg-16]
module.ecr_product.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/product-service]
module.rds_product.aws_db_parameter_group.this: Refreshing state... [id=product-pg-16]
module.ecr_user.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/user-service]
module.rds_user.aws_db_parameter_group.this: Refreshing state... [id=user-pg-16]
module.ecr_payment.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/payment-service]
module.rds_payment.aws_db_parameter_group.this: Refreshing state... [id=payment-pg-16]
module.ecr_product.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/product-service]
module.ecr_payment.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_user.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_order.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refresh complete after 0s [id=3726282990]
module.ecr_policy_user.data.aws_iam_policy_document.push: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.push: Refresh complete after 0s [id=1624808761]
module.ecr_policy_user.aws_iam_policy.pull: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-pull]
module.ecr_policy_user.aws_iam_policy.push: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-push]
module.common_network.aws_route_table.private_db: Refreshing state... [id=rtb-05d66dc5419563992]
module.common_network.aws_internet_gateway.igw: Refreshing state... [id=igw-0e15d27caf5d04488]
module.common_network.aws_route_table.private_app: Refreshing state... [id=rtb-021321f668dab3076]
module.common_network.aws_network_acl.private_app: Refreshing state... [id=acl-02cbcd2a240674c25]
module.common_network.aws_subnet.private-app: Refreshing state... [id=subnet-039f40894ea2007f2]
module.common_network.aws_network_acl.private_db: Refreshing state... [id=acl-0c08493f66d453539]
module.common_network.aws_subnet.public: Refreshing state... [id=subnet-09ad4d9343cfb64c7]
module.common_network.aws_subnet.private-db: Refreshing state... [id=subnet-05a8605bf45055418]
module.common_network.aws_subnet.private-db-2: Refreshing state... [id=subnet-0510549f3411c9d6b]
module.common_network.aws_route_table.public: Refreshing state... [id=rtb-06bc322b3beb2c260]
module.security.aws_security_group.rds_order: Refreshing state... [id=sg-01500a61cef193bc6]
module.security.aws_security_group.rds_product: Refreshing state... [id=sg-0f9265b7ebd7016e2]
module.security.aws_security_group.rds_user: Refreshing state... [id=sg-0c32e1ec713957804]
module.targetgroup_product.aws_lb_target_group.this["tg-product-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-2/ee8471d7a37b7031]
module.targetgroup_product.aws_lb_target_group.this["tg-product-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-1/e43bc2c185041f9b]
module.targetgroup_order.aws_lb_target_group.this["tg-order-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-1/16e1c1748d8d8679]
module.targetgroup_order.aws_lb_target_group.this["tg-order-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-2/99a9bcf62ac70f7c]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-2/405f81a33a3435c6]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-1/e3b3583300f5d98e]
module.targetgroup_user.aws_lb_target_group.this["tg-user-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-1/f8159236aae5bc1e]
module.targetgroup_user.aws_lb_target_group.this["tg-user-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-2/58b11f15cd4e71e3]
module.security.aws_security_group.rds_payment: Refreshing state... [id=sg-0613fe7cffbbed089]
module.common_network.aws_network_acl_rule.private_app_egress_allow_vpc: Refreshing state... [id=nacl-853482340]
module.common_network.aws_network_acl_rule.private_app_ingress_allow_vpc: Refreshing state... [id=nacl-288602567]
module.common_network.aws_route_table_association.private_app_assoc: Refreshing state... [id=rtbassoc-0259d5da3d4635a2b]
module.common_network.aws_network_acl_association.private_app_assoc: Refreshing state... [id=aclassoc-036001ac34e6596a5]
module.common_network.aws_network_acl_rule.private_db_ingress_allow_vpc: Refreshing state... [id=nacl-4266145329]
module.common_network.aws_network_acl_rule.private_db_egress_allow_vpc: Refreshing state... [id=nacl-2621490983]
module.common_network.aws_route.public_internet: Refreshing state... [id=r-rtb-06bc322b3beb2c2601080289494]
module.common_network.aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-01b60d178019c2bc8]
module.common_network.aws_network_acl_association.private_db_assoc: Refreshing state... [id=aclassoc-0b99aba58abc1609f]
module.common_network.aws_route_table_association.private_db_assoc: Refreshing state... [id=rtbassoc-06401706b781b7a9c]
module.nlb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:loadbalancer/net/goorm-nlb/421136e7a7412110]
module.rds_product.aws_db_subnet_group.this: Refreshing state... [id=product-db-subnet-group]
module.rds_user.aws_db_subnet_group.this: Refreshing state... [id=user-db-subnet-group]
module.rds_order.aws_db_subnet_group.this: Refreshing state... [id=order-db-subnet-group]
module.rds_payment.aws_db_subnet_group.this: Refreshing state... [id=payment-db-subnet-group]
module.rds_user.aws_db_instance.this: Refreshing state... [id=user]
module.rds_product.aws_db_instance.this: Refreshing state... [id=product]
module.rds_payment.aws_db_instance.this: Refreshing state... [id=payment]
module.rds_order.aws_db_instance.this: Refreshing state... [id=order]
module.nlb.aws_lb_listener.order_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/74618dfe48f86953]
module.nlb.aws_lb_listener.order_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/3d1cec94767a0636]
module.nlb.aws_lb_listener.user_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/26212242b297b8c1]
module.nlb.aws_lb_listener.user_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/a8c67448b2c2a249]
module.nlb.aws_lb_listener.product_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/365185f97824aca8]
module.nlb.aws_lb_listener.payment_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/ac86689b8519a653]
module.nlb.aws_lb_listener.product_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/51af20e375b22e96]
module.nlb.aws_lb_listener.payment_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/4ed8e2bad945e569]
module.nlb.aws_lb_listener.payment_1: Drift detected (update)
module.nlb.aws_lb_listener.order_2: Drift detected (update)
module.nlb.aws_lb_listener.order_1: Drift detected (update)
module.nlb.aws_lb_listener.user_1: Drift detected (update)
module.nlb.aws_lb.this: Drift detected (update)
module.nlb.aws_lb_listener.payment_2: Drift detected (update)
module.nlb.aws_lb_listener.product_2: Drift detected (update)
module.nlb.aws_lb_listener.user_2: Drift detected (update)
module.nlb.aws_lb_listener.product_1: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security.aws_security_group.vpce will be created
  + resource "aws_security_group" "vpce" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC Interface Endpoints (ECR, CloudWatch)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.9.0.0/16",
                ]
              + description      = "Allow HTTPS from within VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "goorm-vpce-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "goorm-vpce-sg"
        }
      + tags_all               = {
          + "Name" = "goorm-vpce-sg"
        }
      + vpc_id                 = "vpc-05849d37708e8d04b"
    }

  # module.vpc_endpoint.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "goorm-private-rt"
        }
      + tags_all         = {
          + "Name" = "goorm-private-rt"
        }
      + vpc_id           = "vpc-05849d37708e8d04b"
    }

  # module.vpc_endpoint.aws_route_table_association.private_app will be created
  + resource "aws_route_table_association" "private_app" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-039f40894ea2007f2"
    }

  # module.vpc_endpoint.aws_vpc_endpoint.cloudwatch will be created
  + resource "aws_vpc_endpoint" "cloudwatch" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-2.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-039f40894ea2007f2",
        ]
      + tags                  = {
          + "Name" = "goorm-cloudwatch-endpoint"
        }
      + tags_all              = {
          + "Name" = "goorm-cloudwatch-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-05849d37708e8d04b"

      + dns_options (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-2.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-039f40894ea2007f2",
        ]
      + tags                  = {
          + "Name" = "goorm-ecr-api-endpoint"
        }
      + tags_all              = {
          + "Name" = "goorm-ecr-api-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-05849d37708e8d04b"

      + dns_options (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-2.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-039f40894ea2007f2",
        ]
      + tags                  = {
          + "Name" = "goorm-ecr-dkr-endpoint"
        }
      + tags_all              = {
          + "Name" = "goorm-ecr-dkr-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-05849d37708e8d04b"

      + dns_options (known after apply)
    }

  # module.vpc_endpoint.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-2.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "goorm-s3-endpoint"
        }
      + tags_all              = {
          + "Name" = "goorm-s3-endpoint"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-05849d37708e8d04b"

      + dns_options (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 5 of 11 estimated
           $318.0399999999998976/mo +$0.0

<!-- Sticky Pull Request Commentterraform-plan -->